Public Attributes | List of all members
API_StairStructureComponentSettingsVisibility Struct Reference
Element Manager
Settings for visibility of the stair component strucutre. More...
#include <APIdefs_Elements.h>
 Public Attributes
 bool  | uniformSymbolRepresentationEnabled
Settings of uniform symbol representation.
 API_StairStructureComponentSettingsVisibilityOnStory  | structureVisibilityOnStories [API_StairStructSymbRelevantStoriesNum]
Stair structure component visibility settings on relevant stories.
Detailed Description
Settings for visibility of the stair component strucutre.